var Locale = {};
Locale.zh_CN = {
  userAgreement: `重要须知：本协议是您（个人或单一实体）与本应用的开发者之间，关于开发者向您提供本应用所涉相关服务的法律协议。在此特别提醒，用户（您）欲使用相关服务，必须事先认真阅读本服务条款中各条款，包括免除或者限制开发者责任的免责条款及对用户的权利限制。本服务条款一旦发生变更, 将在网页上公布修改内容。修改后的服务条款一旦在网页上公布即有效代替原来的服务条款。您可随时登陆网页查阅最新版服务条款。您若不同意对服务条款的修改，您应不使用或主动取消相关服务。您的任何对本应用的登陆、查看等使用行为将被视为您对本协议和相关修改的理解和接受。<br>
如果您选择接受本协议开通服务，即表示您同意接受协议各项条件的约束。如果您不同意本服务条款，则不能获得使用本服务的权利。您若有违反本条款的任何规定，开发者有权随时中止或终止您服务的使用资格并保留追究相关法律责任的权利<br>
1. 本应用及服务由开发者开发，受中华人民共和国版权法及国际版权条约和其他知识产权法及条约的保护。<br>
2.用户在遵守法律及本条款的前提下可依本协议使用应用及享受服务，但用户无权实施包括但不限于下列行为：<br>
2.1 删除应用及其他副本上所有关于版权的信息、内容；<br>
2.2 对应用进行反向工程、反向汇编、反向编译等；<br>
2.3 对于应用中相关信息等，未经开发者书面同意，用户不得擅自实施包括但不限于下列行为：使用、复制、修改、链接、转载、汇编、发表、出版，建立镜像站点、擅自借助本应用发展与之有关的衍生产品、作品等。<br>
2.4 发表、传送、传播、储存任何违反国家法律法规政策的内容。<br>
2.5 发表、传送、传播、储存任何侮辱、诽谤、色情、暴力、侵害他人权益、引起他人不安的内容。<br>
2.6 发表、传送、传播、储存侵害他人知识产权、商业机密权等合法权利的内容。<br>
2.7 进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器及帐户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本应用系统或网络的弱点或其它实施破坏网络安全的行为； 企图干涉、破坏本应用系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造 TCP/IP 数据包名称或部分名称。<br>
3.  用户须明白，使用本服务产品涉及到互联网服务，可能会受到各个环节不稳定因素的影响。因此服务存在不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。<br>
4.  用户须明白，在使用本服务产品存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须和开发者共同承担以上风险，开发者对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。<br>
5．使用本服务必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于用户违法或违反本协议的使用(包括但不限于言论发表、传送等)而引起的一切责任，由用户负全部责任。<br>
6．尊重用户个人隐私信息的私有性是本应用及服务的原则，开发者将会采取合理的措施保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或用户同意等原因外，未经用户同意不向第三方公开、透露用户个人隐私信息。<br>
7.  特别提醒用户，使用互联网必须遵守国家有关的政策和法律，如刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由用户负全部责任。<br>
7.1.  用户不得使用本应用及服务发送或传播任何妨碍社会治安或非法、虚假、骚扰性、侮辱性、恐吓性、伤害性、破坏性、挑衅性、淫秽色情性等内容的信息。<br>
7.2.  用户不得使用本应用及服务发送或传播敏感信息和违反国家法律制度的信息。<br>
7.3.  用户应当在发现非法或不良内容时，积极向开发者就此内容投诉，<br>
7.4.  本应用及服务同大多数因特网产品一样，易受到各种安全问题的困扰，包括但不限于：<br>
1）  透露详细个人资料，被不法分子利用，造成现实生活中的骚扰。<br>
2）  哄骗、破译密码。<br>
3）  下载安装的其它软件中含有“特洛伊木马”等病毒，威胁到计算设备上信息和数据的安全，继而威胁对本应用及服务的使用。<br>
8.  请用户注意勿在使用本应用及服务中透露自己的各类财产帐户、银行卡、信用卡、及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。<br>
9.  用户应规范、合法地使用本应用及服务，如用户有在公共环境下捣乱、骚扰、欺骗其他用户等行为或者实施其他违反本协议的行为，一经发现，开发者有权停止服务。<br>
10.用户须明白，开发者为了本应用整体运营的需要，开发者拥有随时修改或中断、中止或终止服务而不需通知您的权利，开发者行使前述权利不需对您或任何第三方负责或承担任何赔偿责任。<br>
11.本服务条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆法律。若发生任何纠纷或争议，应当友好协商解决，协商不成的，均应提交开发者所在城市人民法院解决。<br>`,
  uidErrorFeedback: { 
    email:'请输入邮箱地址。', 
    phone:'请输入手机号码。', 
    aiid:'请输入以*开头的远近号。', 
    uid:'请输入邮箱地址或手机号。',
    noType:'请先选定账号类型！' },
/*  pwdPrompt: { 
    login:'老用户请输入密码，新用户请设置密码', 
    checkin:'老用户请验证您的密码',
    register:'新用户请设置长度6位以上的密码', 
    reset:'请设置您的新密码'
  }, */
  pwdErrorFeedback: { Soweb_Malformed_Pwd:'密码不能少于6位。' },
  pcdErrorFeedback: { 
    Soweb_Malformed_Pcd:'验证码是6位数字。',
    busySending:'正在发送中，请稍候...',
    Soweb_Unknown_Sending_Error:'验证码发送失败，请再试一次。', 
    /* 来自 后台Person 的 sendConfirmTicket */
    TicketCreationFailed:'无法创建验证码，请再试一次。',
    EmailSendDone:'验证码发送成功，10分钟内有效。', 
    EmailSendFail:'验证码发送失败，请再试一次。',
    EmailBadInput:'验证码发送失败，请刷新后再试一次。', // 在 php 的 Tool 的 sendMail 内部，缺少 content, subject, email等参数。js 版后台没有它。
    SmsSendDone:'验证码发送成功，10分钟内有效。', 
    SmsSendFail:'验证码发送失败，请再试一次。',
    SmsBadInput:'验证码发送失败，请刷新后再试一次。', // 在 php 的 Tool 的 sendMail 内部，缺少 content, subject, email等参数。js 版后台没有它。
    EnvBadInput:'无法发送验证码，请刷新后再试一次。' // 在 php/js 的 API 的 sendConfirmTicket 内部，缺少 person/star 参数 
  },
  loginFeedback: { 
    LOGIN:'努力验证中，请稍候...',
    LOGIN_SUCCESS:'登录成功啦！马上进入账户...', 
    LOGIN_FAIL:'登录失败 :( 请再试一次。', 
    InsertFailed:'新建账号失败。请再试一次。', 
    MismatchPhonePwd:'手机号和密码不匹配。请再试一次。', 
    MismatchEmailPwd:'邮箱和密码不匹配。请再试一次。', 
    MismatchAiidPwd:'星号和密码不匹配。请再试一次。', 
    MismatchPwd:'密码错误。请再试一次。',
    MissingLoginInfo:'请输入完整的账号和密码信息。', 
    MissingSignupInfo:'请提供邮箱或手机号，即可新建账户',

    RESET_SUCCESS:'密码重设成功，请重新登录。', 
    RESET_FAIL:'密码重设失败，请检查账号和验证码。' // 可能是验证码错误或已失效，或者该账户尚不存在。
  },
  changePwdFeedback:{
    CHANGEPWD_SUCCESS:'密码修改成功！',
    CHANGEPWD_FAIL:'密码修改失败，请再试一次！',
    CHANGEPWD_INVALID:'密码不符合要求，请再试一次。'
  },
  dialogFeedback: {
    SUBMIT_MOMENT_DONE: '您的时光已经发表！',
    SUBMIT_MOMENT_FAIL: '您的速记没有成功提交，请再试一遍。',
    SUBMIT_MOMENT_EMPTY: '请先添加一些内容吧！',
    SUBMIT_REPLY_DONE: '您的回复已经发表',
    SUBMIT_REPLY_FAIL: '您的回复没有成功发表，请再试一遍',
    SUBMIT_REPLY_EMPTY: '请先添加一些内容吧！',
    SUBMIT_REPLY_OFFLINE: '登录后，即可回复。',
    UPLOAD_DONE:'保存好啦！',
    UPLOAD_FAIL:'真抱歉，文件上传失败，请再试一次。',
    ACTION_SOUND_FAIL:'真抱歉，录音失败，请再试一次。',
    ACTION_VIDEO_FAIL:'真抱歉，摄像失败，请再试一次。',
    ACTION_VOTE_OFFLINE: '登录后，即可投票。'
  }
}

for (var l of sow.Locale.LangSet){
    if (l.code!=='zh_CN')
      Locale[l.code]=Locale.zh_CN;
}
